#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
infra/instances/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/cd-testing/cd-testing/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/cd-testing/cd-testing

To view this run in a browser, visit:
https://app.terraform.io/app/kautomate/clidriven/runs/run-2S5YUxrqa8c7PpHN

Waiting for the plan to start...

Terraform v1.7.5
on linux_amd64
Initializing plugins and modules...
random_id.server: Refreshing state... [id=xQu9mPUSTwg]
random_id.server_PR_3: Refreshing state... [id=bLqRFnAFutg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo will be created
  + resource "aws_instance" "staging_cicd_demo" {
      + ami                                  = "ami-0c1c30571d2dae5c9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-c50bbd98f5124f08"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-c50bbd98f5124f08"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0d2411db69a112a30",
        ]
    }

  # aws_instance.staging_cicd_demo_PR_3 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_3" {
      + ami                                  = "ami-0c1c30571d2dae5c9"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_3"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_3"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0d2411db69a112a30",
        ]
    }

  # aws_key_pair.staging_key will be created
  + resource "aws_key_pair" "staging_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "staging-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC0ZknR7ZSExO5ZWCJRFVIE9AOO9kxyHFnB6OhjrIWCdG4zEogF9bnDhwyS7Q2UkGKP7tnCgrJgWhYQ/trPkgCT/onn/uiNQLwc8CP9RaHcs7JP5jnO7cV8q3Pd3YK5uvR6N4ins5cVhWIrzxoRnATHIE1GuvalYP7h0295GEalDaV5Fdw+PO1PB/QyOor4UDnyEvgRd/9EbORO+0WiR6Q7L/p+wpT42XeYnqA2ewhFPPlzGJd9nqUbNP+ehkvqoVdnAUIXLqWRXHfPEugLGhc4Cc0B4Kg/kyD59fCblBlAkUB/3kTYyc3mAPXrxqO6ju6dG4WeN4J9R7U3gnVpEx6I7xUB/+u/fGSQTHEO2SxAzJqfMgKQevCOquflAt0lIV0VGQewJpBx0KZU8A4+9C+iBvlruzxlAVr/In/MSTXQFf1TI49gSf5oODVEuWvouad3Aw6HjlaV39RIrDtb9Uk5JUTOs6VUWpgz51gyvXF0m0+lhJcd7AAf5R8mpZuSoiylehsOueLxOweIddm0Znq6pVG1o9bA7/Q3JK/8CUrtqyo3YxPaTqOvnfuOKJTw6HYJ9sgy+TIglXK2WYvfk+WTrGFbyr4SRa3qiKSIKcv+7a/qngxbV3aF7HUQDmBUKLRvtIetPw4r7mr/AYV0eS7Y++tnU1NfXPQ1ZFKRYW8QIw== ubuntu@sample-server"
      + tags            = {
          + "Name" = "staging_public_key"
        }
      + tags_all        = {
          + "Name" = "staging_public_key"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + staging_dns      = (known after apply)
  + staging_dns_PR_3 = (known after apply)

```

</details>

*Pusher: @KiranChilledOut, Action: `workflow_dispatch`*